SunCity/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоРаспознавания</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
  <enumValues>
    <name>ОблачнаяККТ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьWebСервисОборудование</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/КассоваяСмена/КассоваяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассоваяСмена</name>
  <attributes>
    <name>ДатаПервогоНепереданногоФД</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСменыККТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>DefinedType.КассаБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНепереданныхФД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаСтрочнаяЗаменаФН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПамятьФНПереполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПревышеноВремяОжиданияОтветаОФД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсФНИсчерпан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКассовойСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФДОЗакрытииСмены</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальноеУстройство</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяКассоваяСмена</name>
    <type>
      <types>DocumentRef.УдалитьКассоваяСмена</types>
    </type>
  </attributes>
</mdclass:Document>

SunCity/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыККМ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ИспользоватьБезПодключенияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРаспределенияВыручкиПоСекциям</name>
    <type>
      <types>CatalogRef.НастройкиРаспределенияВыручкиПоСекциямФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеВидовОплаты</name>
    <type>
      <types>CatalogRef.СоответствиеВидовОплатыСККМOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассы</name>
    <type>
      <types>EnumRef.ТипыКассККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРучнойРежимФормированияЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФормироватьНефискальныеЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМ</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМВозврат</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьБумажныйЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ВидТранспортаОфлайнОбмена</name>
    <type>
      <types>EnumRef.ВидыТранспортаОфлайнОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWebСервисОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособФорматноЛогическогоКонтроля</name>
    <type>
      <types>EnumRef.СпособыФорматноЛогическогоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОфлайнОборудования</name>
    <type>
      <types>EnumRef.ТипыОфлайнОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяУстановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВерсияФорматаОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПризнакСпособаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПризнакПредметаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяФискализация</name>
    <comment>Автоматическая фискализация чеков из очереди чеков</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФН36</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованием</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринтерПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьЦенникиВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРегистрации</name>
    <attributes>
      <name>НаименованиеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonModules/ИнтеграцияWebKassaВызовСервераПереопределяемый/Module.bsl
#Область Прочее

// Функция возвращает список касс ККМ
//
Функция ПолучитьСписокКассККМ(ПодключаемоеОборудование) Экспорт

	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	СписокКассККМ = Новый Массив();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка,
	|	КассыККМ.Наименование
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.РабочееМесто = &РабочееМесто
	|	И КассыККМ.ПодключаемоеОборудование = &ПодключаемоеОборудование
	|	И КассыККМ.ПометкаУдаления = Ложь");
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ПодключаемоеОборудование", ПодключаемоеОборудование);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КассаККМ = Новый Структура;
		КассаККМ.Вставить("Ссылка",      Выборка.Ссылка);
		КассаККМ.Вставить("Наименование",Выборка.Наименование);
		СписокКассККМ.Добавить(КассаККМ);
	КонецЦикла;
	
	Возврат СписокКассККМ;
	
КонецФункции

// Функция возвращает сведения об организации
//
Функция ПолучитьСведенияОбОрганизации(Организация, ДатаПериода) Экспорт
	
	Сведения = ФормированиеПечатныхФормСервер.СведенияОЮрФизЛице(Организация,ДатаПериода);
	НДС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,"СерияСвидетельстваПоНДС, НомерСвидетельстваПоНДС");
	Сведения.Вставить("СерияСвидетельстваПоНДС",НДС.СерияСвидетельстваПоНДС);
	Сведения.Вставить("НомерСвидетельстваПоНДС",НДС.НомерСвидетельстваПоНДС);
	Сведения.Вставить("ПризнакЮрЛица", ?(Сведения.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо, Истина, Ложь));
	//Имя кассира
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	Сведения.Вставить("Кассир", Кассир);
	Возврат Сведения;
	
КонецФункции

// Функция возвращает параметры кассы ККМ
//
Функция ПолучитьРеквизитыКассы(КассаККМ) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ,"СерийныйНомер, РегистрационныйНомер, Наименование, Владелец");
	//Реквизиты.Вставить("Кассир",ПолучитьКассираКассовойСмены(КассаККМ));
	//Имя кассира
	Кассир = "";
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	Реквизиты.Вставить("Кассир", Кассир);
	Возврат Реквизиты;
	
КонецФункции

// Функция возвращает кассира для кассовой смены кассы ККМ
//
Функция ПолучитьКассираКассовойСмены(КассаККМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Кассир.Наименование КАК Кассир
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.КассаККМ = &КассаККМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Кассир;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Функция возвращает сведения об организации и параметры кассы ККМ
//
Функция ПолучитьСведенияОбОрганизацииИКассеККМ(Организация, ДатаПериода, КассаККМ) Экспорт
	
	Если Организация=Неопределено Тогда 
		 Организация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ,"Владелец").Владелец;
	КонецЕсли;
	Сведения = ПолучитьСведенияОбОрганизации(Организация,ДатаПериода);
	РеквизитыКассыККМ = ПолучитьРеквизитыКассы(КассаККМ);
	Сведения.Вставить("СерийныйНомер",РеквизитыКассыККМ.СерийныйНомер);
	Сведения.Вставить("РегистрационныйНомер",РеквизитыКассыККМ.РегистрационныйНомер);
	Сведения.Вставить("Кассир",РеквизитыКассыККМ.Кассир);
	Сведения.Вставить("ОрганизацияСсылка",Организация);
	
	Возврат Сведения;
	
КонецФункции

// Функция возвращает сведения об организации и параметры кассы ККМ по документу
//
Функция ПолучитьСведенияОбОрганизацииИКассеККМПоДокументу(Документ, КассаККМ) Экспорт
	
	Возврат ПолучитьСведенияОбОрганизацииИКассеККМ(Документ.Организация, Документ.Дата, КассаККМ);
	
КонецФункции

// Функция возвращает параметры подключаемого оборудования
//
Функция ПолучитьСерийныйНомерУстройства(ПодключаемоеОборудование) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодключаемоеОборудование,"СерийныйНомер, ДрайверОборудования, РабочееМесто, Параметры");
	Возврат Реквизиты.СерийныйНомер;
	
КонецФункции

//Функция вызывает стандартную проверку, чтобы определить включена ли ф.о "Использовать подключаемое оборудование"
//
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	Возврат ОбщегоНазначенияРТ.ИспользоватьПодключаемоеОборудование();
	
КонецФункции

// Функция регистрирует новое подключаемое оборудование с драйвером 1С:WebKassa.
//
Функция СоздатьПодключаемоеОборудованиеWebkassa(Организация, Наименование = "", СерийныйНомер) Экспорт
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(Организация)
		Или Не ЗначениеЗаполнено(СерийныйНомер) Тогда
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("АвтоматическаяПечатьЧека", Ложь);
	НовыеЗначениеПараметров.Вставить("ШиринаЛенты"             , Неопределено);
	//МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	НовоеОборудование = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
	НовоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор;
	НовоеОборудование.ДрайверОборудования = Справочники.ДрайверыОборудования.ДрайверWebkassaФискальныеРегистраторы;
	НовоеОборудование.УстройствоИспользуется = Истина;
	НовоеОборудование.Организация = Организация;
	НовоеОборудование.Параметры = НовыеЗначениеПараметров;
	НовоеОборудование.РабочееМесто = РабочееМесто;
	НовоеОборудование.СерийныйНомер = СерийныйНомер;
	
	ШаблонНаименования = НСтр("ru = '''1С:WebKassa''- %1 (%2) на %3'");
	ШаблонНаименования = СтрЗаменить(ШаблонНаименования, "%1", Наименование);
	ШаблонНаименования = СтрЗаменить(ШаблонНаименования, "%2", СерийныйНомер);
	ШаблонНаименования = СтрЗаменить(ШаблонНаименования, "%3", РабочееМесто);
	НовоеОборудование.Наименование = ШаблонНаименования;
	Попытка
		НовоеОборудование.Записать();
		Результат = НовоеОборудование.Ссылка;
	Исключение
		Результат = Ложь;
		ТекстСообщения = НСтр("ru = 'Не удалось создать подключаемое оборудование по причине: %Причина%'");
		//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Организация);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ИнтеграцияWebKassaКлиентСервер.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			НовоеОборудование.Ссылка.Метаданные(), , ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИзменитьСерийныйНомерОборудования(Оборудование, НовыйСерийныйНомер) Экспорт
	
	Результат = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Оборудование.Ссылка.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Оборудование.Ссылка);
		Блокировка.Заблокировать();
		
		ОбъектДляОбработки = Оборудование.Ссылка.ПолучитьОбъект();
		Если ОбъектДляОбработки = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ОбъектДляОбработки.СерийныйНомер = НовыйСерийныйНомер;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектДляОбработки, Истина, Истина);
		
		ЗафиксироватьТранзакцию();
		
		Результат = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось серийный номер %Ссылка% по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Оборудование.Ссылка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ИнтеграцияWebKassaКлиентСервер.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Оборудование.Ссылка.Метаданные(), Оборудование.Ссылка, ТекстСообщения);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНаименованиеЕдиницыИзмерения(КодЕдиницыИзмерения = "") Экспорт
	
	Результат = "";
	Если Не ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	//ищем единицу измерения по справочнику
	ЕдиницаИзмерения = Справочники.БазовыеЕдиницыИзмерения.НайтиПоКоду(КодЕдиницыИзмерения, Ложь);
	Если Не ЕдиницаИзмерения = Справочники.БазовыеЕдиницыИзмерения.ПустаяСсылка() Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Наименование");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Значение реквизита, прочитанного из информационной базы по ссылке на объект.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

// Возвращает макет печатной формы по полному пути к макету.
//
Функция ПолучитьМакетПечатнойФормы(ИмяМакета) Экспорт
	
	Возврат УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
КонецФункции

// Возвращает двоичные данные для формирования QR кода.
//
Функция ПолучитьQRКод(QRСтрока, УровеньКоррекции, Размер) Экспорт
	
	Возврат УправлениеПечатью.ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер);
	
КонецФункции

// Проверяет наличие у произвольного объекта реквизита с указанным именем.
//
Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначенияРТКлиентСервер.ЕстьРеквизитОбъекта(Объект, ИмяРеквизита);
	
КонецФункции

// Подставляет параметры в строку.
//
Функция ПодставитьПараметрыВСтроку(ШаблонСообщения, Параметр1) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Параметр1);
	
КонецФункции

//Выводит сообщение пользователю
//
Процедура СообщитьПользователю(ТекстСообщения, Знач КлючДанных = Неопределено, Знач Поле = "", Знач ПутьКДанным = "") Экспорт
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		КлючДанных,
		Поле,
		ПутьКДанным);
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

// Получает рабочее место клиента
//
Функция ПолучитьРабочееМестоКлиента() Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
КонецФункции

// Получает параметры идентификатора
//
Функция ПолучитьПараметрыУстройства(Идентификатор) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ПолучитьПараметрыУстройства(Идентификатор);
	
КонецФункции

#КонецОбласти
